## Iloc and Loc

In [ ]:
import pandas as pd
import numpy as np

In [4]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

### iloc

Recupera ...

In [ ]:
#Operador  .iloc
#data.iloc[<filas>, <columna>]
print()

In [ ]:
df.iloc[1] #Segunda  fila

In [5]:
df.iloc[-1] #Ultima fila

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [7]:
df.iloc[:,0] #Pimer columna

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [8]:
df.iloc[:,1] #Segunda columna

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [9]:
df.iloc[:,-1] #Ultima columna

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [10]:
df.iloc[1:3] #Rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [11]:
df.iloc[0:3:2] #Rango de filas

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [12]:
df.iloc[:, 1:3] #Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [16]:
df.iloc[[1,3,0]] #Lista de filas
#El orden en que aparezcan en las listas es como van a mostrarse

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True
0        Juan Pérez 1995-12-21   2500.0          True

In [15]:
df.iloc[:,[1,3,0]] #Lista de columnas (usamos dos parametros)

      fechas  al_corriente           nombres
0 1995-12-21          True        Juan Pérez
1 1989-01-13          True     María Sánchez
2 1992-09-14         False      Jorge Vargas
3 1993-07-08          True  Rodrigo Martínez

In [17]:
df.iloc[[1,3,0],[1,3,0]] #Lista de filas y columnas

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [18]:
df.iloc[1, [1,3,0]]

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [19]:
df.iloc[1,:]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [21]:
df.iloc[1,'fechas'] # iloc no trabaja con etiquetas, para ello usamos loc

### Loc

Recupera filas y columnas por etiqueta(s) o una matriz booleana

In [23]:
df.loc[1:3] #Rango de filas.
# Aquí 1, 2 y 3 no son , son nombres de etiquetas

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [24]:
df.loc[:, 'saldo'] #Rango de columnas

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [25]:
df.loc[:, 'saldo':'al_corriente'] #Rango de columnas

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

In [26]:
df.loc[:, 'saldo':'fechas'] #Rango de columnas

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [27]:
df.loc[:, 'fechas':'saldo'] #Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [28]:
df.loc[:, ['fechas','saldo','nombres']] #Rango de columnas

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [29]:
df.loc[1, ['fechas','saldo','nombres']] #Rango de columnas

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [30]:
df.loc[1:3, ['fechas','saldo','nombres']] #Rango de filas y columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [31]:
df.loc[[1,3,2], ['fechas','saldo','nombres']] #Rango de filas y columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
3 1993-07-08  11323.2  Rodrigo Martínez
2 1992-09-14      NaN      Jorge Vargas

In [42]:
# Iloc VS Loc 

print(df.loc[1:3])
print("\n" + "---------".center(60,"*") + "\n")
print(df.iloc[1:3])

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

*************************---------**************************

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [36]:
df_iloc = df.iloc[1:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [40]:
# Iloc VS Loc 
print(df_iloc.loc[1])
print("\n" + "---------".center(60,"*") + "\n")
print(df_iloc.iloc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

*************************---------**************************

nombres                Jorge Vargas
fechas          1992-09-14 00:00:00
saldo                           NaN
al_corriente                  False
Name: 2, dtype: object

In [43]:
df['saldo'] > 3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [44]:
df.loc[df['saldo'] > 3000]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [45]:
df.loc[df['saldo'] > 3000, ['nombres', 'saldo']]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [46]:
ss3 = df['saldo'] > 3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [47]:
df.loc[ss3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [49]:
df.loc[~ss3] #Clientes con un saldo no mayor a 3000

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [50]:
df['al_corriente']

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [53]:
df.loc[df['al_corriente'], 'nombres':'saldo']

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

In [54]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [57]:
df.isnull()

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [56]:
df_null = df.isnull()
df_null

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [60]:
#Visualizar el numero de datos faltantes por columna
print(type(df.isnull().sum()))
df.isnull().sum()

<class 'pandas.core.series.Series'>

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [59]:
#Visualizar el numero de datos faltantes Total
df.isnull().sum().sum()

1

In [62]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [63]:
df.isnull().values.any()

True

In [64]:
df.isnull().any()

nombres         False
fechas          False
saldo            True
al_corriente    False
dtype: bool

In [ ]:
df[df.isnull().any(1)]